#+TITLE: Hecklist
#+PROPERTY: header-args :results output :exports both
#+OPTIONS: H:2 TOC:1 view:showall

A Haskell checklist for starting off projects, or starting over.

** [[https://www.haskell.org/ghcup/][ghcup]]

#+begin_src zsh :results output
  curl --proto '=https' --tlsv1.2 -sSf https://get-ghcup.haskell.org | sh
#+end_src

#+begin_src zsh :results output :exports both
which cabal
#+end_src

#+RESULTS:
: /Users/tonyday/.ghcup/bin/cabal

#+begin_src zsh :results output :exports both
cabal --version
#+end_src

#+RESULTS:
: cabal-install version 3.4.0.0
: compiled using version 3.4.0.0 of the Cabal library

#+begin_src zsh :results output
ghc --version
#+end_src

#+RESULTS:
: The Glorious Glasgow Haskell Compilation System, version 8.10.4

#+begin_src zsh :results output
stack --version
#+end_src

#+RESULTS:
: Version 2.7.3, Git revision 7927a3aec32e2b2e5e4fb5be76d0d50eddcc197f x86_64 hpack-0.34.4


~stack~ inspects the stack.yaml and selects the ghc that matches, so stack ghc and cabal ghc can be different.

#+begin_src zsh :rsults output
stack exec -- which ghc
#+end_src

#+RESULTS:
: /Users/tonyday/.ghcup/ghc/8.10.4/bin/ghc

#+begin_src zsh :rsults output
which ghc
#+end_src

#+RESULTS:
: /Users/tonyday/.ghcup/bin/ghc

#+begin_src zsh :results output
haddock --version
#+end_src

#+RESULTS:
: Haddock version 2.24.0, (c) Simon Marlow 2006
: Ported to use the GHC API by David Waern 2006-2008

#+begin_src zsh :results output
haskell-language-server --version
#+end_src

#+RESULTS:
: haskell-language-server version: 1.3.0.0 (GHC: 9.0.1) (PATH: /Users/tonyday/.ghcup/bin/haskell-language-server-9.0.1~1.3.0) (GIT hash: e7c5e90b6df5dff2760d76169eddaea3bdd6a831)

Note that haskell-langiuage-server versions matching older GHC versions are also installed, and selected automatically.

#+begin_src zsh :results output :text-properties t
ghcup list
#+end_src

#+RESULTS:
#+begin_example
   Tool  Version        Tags                      Notes
✗  ghc   7.10.3         base-4.8.2.0
✗  ghc   8.0.2          base-4.9.1.0
✗  ghc   8.2.2          base-4.10.1.0
✗  ghc   8.4.1          base-4.11.0.0
✗  ghc   8.4.2          base-4.11.1.0
✗  ghc   8.4.3          base-4.11.1.0
✗  ghc   8.4.4          base-4.11.1.0
✗  ghc   8.6.1          base-4.12.0.0
✗  ghc   8.6.2          base-4.12.0.0
✗  ghc   8.6.3          base-4.12.0.0
✗  ghc   8.6.4          base-4.12.0.0             hls-powered
✗  ghc   8.6.5          base-4.12.0.0             hls-powered
✗  ghc   8.8.1          base-4.13.0.0
✗  ghc   8.8.2          base-4.13.0.0
✗  ghc   8.8.3          base-4.13.0.0             hls-powered
✓  ghc   8.8.4          base-4.13.0.0             hls-powered
✗  ghc   8.10.1         base-4.14.0.0
✗  ghc   8.10.2         base-4.14.1.0             hls-powered
✗  ghc   8.10.3         base-4.14.1.0             hls-powered
✔✔ ghc   8.10.4         base-4.14.1.0             hls-powered
✗  ghc   8.10.5         base-4.14.2.0             hls-powered
✓  ghc   8.10.6         base-4.14.3.0
✗  ghc   8.10.7         recommended,base-4.14.3.0
✓  ghc   9.0.1          latest,base-4.15.0.0      hls-powered
✓  ghc   9.2.0.20210821 prerelease,base-4.16.0.0
✗  cabal 2.4.1.0
✗  cabal 3.0.0.0
✗  cabal 3.2.0.0
✔✔ cabal 3.4.0.0        latest,recommended
✓  hls   1.1.0
✓  hls   1.2.0
✔✔ hls   1.3.0          latest,recommended
✗  stack 2.5.1
✓  stack 2.7.1
✔✔ stack 2.7.3          latest,recommended
✔✔ ghcup 0.1.16.2       latest,recommended
#+end_example

** tools

- [[https://hackage.haskell.org/package/hlint][hlint]]
- [[https://hackage.haskell.org/package/ormolu][ormolu]]
- [[https://github.com/kowainik/stan#stan][stan]]
- [[https://hackage.haskell.org/package/haddock][haddock]]
- [[https://github.com/haskell-CI/haskell-ci][haskell-ci]]

#+begin_src zsh
cabal install ormolu hlint stan ghcid haskell-ci
#+end_src

~cabal~ stores executables in ~~​/.cabal/bin~, ~stack~ in ~~​/.local/bin~.

#+begin_src zsh :results output
which hlint
#+end_src

#+RESULTS:
: /Users/tonyday/.cabal/bin/hlint

*** Literate Programming

An org file can also be used as a project readme. Sort of see [[https://github.com/novoid/github-orgmode-tests/blob/master/README.org]] for current state.

Haskell also works out of the box in org-mode these days and is worth playing around with for anyone interested in hacky literate programming.

[[https://necromuralist.github.io/posts/org-babel-cheat-sheet/][org babel cheat sheet]]

#+begin_src haskell :results value
x = 1
putStrLn $ show x
#+end_src

#+RESULTS:
: 1

** Front matter

Edit properties in [[#Checklist][Checklist]] to point to the right directory.

#+begin_src zsh
ls -la
#+end_src

#+RESULTS:
| total      | 72 |         |       |      |   |     |       |                     |
| drwxr-xr-x | 20 | tonyday | staff |  640 | 3 | Sep | 09:01 | .                   |
| drwxr-xr-x |  8 | tonyday | staff |  256 | 3 | Sep | 08:08 | ..                  |
| drwxr-xr-x | 12 | tonyday | staff |  384 | 2 | Sep | 21:29 | .git                |
| -rw------- |  1 | tonyday | staff |   31 | 2 | Sep | 10:40 | .gitattributes      |
| drwxr-xr-x |  3 | tonyday | staff |   96 | 2 | Sep | 10:40 | .github             |
| -rw------- |  1 | tonyday | staff |   87 | 2 | Sep | 10:40 | .gitignore          |
| drwxr-xr-x |  4 | tonyday | staff |  128 | 2 | Sep | 10:40 | .hie                |
| -rw------- |  1 | tonyday | staff |    0 | 2 | Sep | 10:40 | .projectile         |
| drwxr-xr-x |  5 | tonyday | staff |  160 | 2 | Sep | 17:16 | .stack-work         |
| -rw------- |  1 | tonyday | staff | 1513 | 2 | Sep | 10:40 | LICENSE             |
| drwxr-xr-x |  3 | tonyday | staff |   96 | 2 | Sep | 10:40 | app                 |
| -rw-r--r-- |  1 | tonyday | staff |   34 | 3 | Sep | 09:01 | cabal.project.local |
| drwxr-xr-x |  6 | tonyday | staff |  192 | 3 | Sep | 09:01 | dist-newstyle       |
| -rw------- |  1 | tonyday | staff | 1318 | 2 | Sep | 10:40 | foo.cabal           |
| -rw------- |  1 | tonyday | staff |  182 | 2 | Sep | 10:40 | hie.yaml            |
| -rw------- |  1 | tonyday | staff |  432 | 2 | Sep | 10:40 | readme.md           |
| drwxr-xr-x |  3 | tonyday | staff |   96 | 2 | Sep | 17:16 | src                 |
| -rw------- |  1 | tonyday | staff |   36 | 2 | Sep | 10:40 | stack.yaml          |
| -rw------- |  1 | tonyday | staff |  447 | 2 | Sep | 17:16 | stack.yaml.lock     |
| drwxr-xr-x |  3 | tonyday | staff |   96 | 2 | Sep | 10:40 | test                |

Check/set the ghc version

#+begin_src zsh
ghcup set ghc 8.10.4
#+end_src

#+RESULTS:

** Compiling

- [[https://www.haskell.org/cabal/][cabal]]

  #+begin_src zsh
  cabal clean
  #+end_src

  #+RESULTS:

  It's so very useful to check the build plan before actiually building, as ~cabal configure~ does.

  #+begin_src zsh :results output
  cabal configure --enable-tests
  #+end_src

  #+RESULTS:
  : 'cabal.project.local' already exists, backing it up to
  : 'cabal.project.local~5'.
  : Resolving dependencies...
  : Build profile: -w ghc-8.10.4 -O1
  : In order, the following would be built (use -v for more details):
  :  - doctest-0.18.1 (exe:doctest) (requires build)
  :  - foo-0.0.1 (lib) (first run)
  :  - foo-0.0.1 (test:test) (first run)
  :  - foo-0.0.1 (exe:foo) (first run)


  #+begin_src zsh :results output
  cabal build
  #+end_src

  #+RESULTS:
  #+begin_example
  Build profile: -w ghc-8.10.4 -O1
  In order, the following will be built (use -v for more details):
   - foo-0.0.1 (lib) (first run)
   - foo-0.0.1 (test:test) (first run)
   - foo-0.0.1 (exe:foo) (first run)
  Configuring library for foo-0.0.1..
  Preprocessing library for foo-0.0.1..
  Building library for foo-0.0.1..
  [1 of 1] Compiling Lib              ( src/Lib.hs, /Users/tonyday/haskell/hecklist/foo/dist-newstyle/build/x86_64-osx/ghc-8.10.4/foo-0.0.1/build/Lib.o, /Users/tonyday/haskell/hecklist/foo/dist-newstyle/build/x86_64-osx/ghc-8.10.4/foo-0.0.1/build/Lib.dyn_o )
  Configuring test suite 'test' for foo-0.0.1..
  Configuring executable 'foo' for foo-0.0.1..
  Preprocessing executable 'foo' for foo-0.0.1..
  Building executable 'foo' for foo-0.0.1..
  Preprocessing test suite 'test' for foo-0.0.1..
  Building test suite 'test' for foo-0.0.1..
  [1 of 1] Compiling Main             ( app/app.hs, /Users/tonyday/haskell/hecklist/foo/dist-newstyle/build/x86_64-osx/ghc-8.10.4/foo-0.0.1/x/foo/build/foo/foo-tmp/Main.o )
  [1 of 1] Compiling Main             ( test/test.hs, /Users/tonyday/haskell/hecklist/foo/dist-newstyle/build/x86_64-osx/ghc-8.10.4/foo-0.0.1/t/test/build/test/test-tmp/Main.o )
  Linking /Users/tonyday/haskell/hecklist/foo/dist-newstyle/build/x86_64-osx/ghc-8.10.4/foo-0.0.1/x/foo/build/foo/foo ...
  Linking /Users/tonyday/haskell/hecklist/foo/dist-newstyle/build/x86_64-osx/ghc-8.10.4/foo-0.0.1/t/test/build/test/test ...
  #+end_example

  #+begin_src zsh :results output
  cabal test
  #+end_src

  #+RESULTS:
  #+begin_example
  Build profile: -w ghc-8.10.4 -O1
  In order, the following will be built (use -v for more details):
   - foo-0.0.1 (test:test) (ephemeral targets)
  Preprocessing test suite 'test' for foo-0.0.1..
  Building test suite 'test' for foo-0.0.1..
  Running 1 test suites...
  Test suite test: RUNNING...
  Test suite test: PASS
  Test suite logged to:
  /Users/tonyday/haskell/hecklist/foo/dist-newstyle/build/x86_64-osx/ghc-8.10.4/foo-0.0.1/t/test/test/foo-0.0.1-test.log
  1 of 1 test suites (1 of 1 test cases) passed.
  #+end_example

- [[https://docs.haskellstack.org/en/stable/README/][stack]]

  #+begin_src zsh :results raw
    stack build --test
  #+end_src

  #+RESULTS:

- full compile with -Werror

    #+begin_src zsh :results output
    stack build --test --haddock --no-haddock-deps --ghc-options -Werror --ghc-options -Wcompat --ghc-options -Wincomplete-record-updates --ghc-options -Wincomplete-uni-patterns --ghc-options -Wredundant-constraints
    #+end_src

- development loops

  =haskell-language-server= works well for code that has recently compiled, but tends to suffer when fed projects that are less than pristine already. To bootstrap from a mess of garbage like I usually do, use =ghcid= and, when this falls over, revert to =stack build --test --file-watch= which will never fail.

** Linting

- [[https://hackage.haskell.org/package/hlint][hlint]]
  #+begin_src zsh :results output
  hlint .
  #+end_src

  #+RESULTS:
  : No hints

- [[https://hackage.haskell.org/package/ormolu][ormolu]]

  (~--mode inplace~ to actually change haskell files)

  #+begin_src zsh :results output
  ormolu --mode check $(git ls-files '*.hs')
  #+end_src

  #+begin_src zsh :results output
  ormolu --mode check */*.hs
  #+end_src

  #+RESULTS:

** Analysis

- [[https://github.com/kowainik/stan#stan][stan]]
  #+begin_src zsh :results output
  stan
  #+end_src

  #+RESULTS:
  #+begin_example
    ⓘ Checking environment variables and CLI arguments for default configurations file usage...
      Fiasco:
        * [Error  ] No STAN_USE_DEFAULT_CONFIG Env Variable is set
        ,* [Error  ] No CLI option specified for no-default

    ⓘ The following Configurations are used:

      Result:

      With the following warnings:
        * [Warning] TOML Configurations file doesn't exist: /Users/tonyday/haskell/hecklist/foo/.stan.toml
        ,* [Warning] TOML Configurations file doesn't exist: /Users/tonyday/.stan.toml
        ,* [Warning] No CLI option specified for: checks
        ,* [Warning] configChecks is set through the source: Default
        ,* [Warning] TOML Configurations file doesn't exist: /Users/tonyday/haskell/hecklist/foo/.stan.toml
        ,* [Warning] TOML Configurations file doesn't exist: /Users/tonyday/.stan.toml
        ,* [Warning] No CLI option specified for: remove
        ,* [Warning] configRemoved is set through the source: Default
        ,* [Warning] TOML Configurations file doesn't exist: /Users/tonyday/haskell/hecklist/foo/.stan.toml
        ,* [Warning] TOML Configurations file doesn't exist: /Users/tonyday/.stan.toml
        ,* [Warning] No CLI option specified for: ignore
        ,* [Warning] configIgnored is set through the source: Default

    ⓘ Using the following .cabal file: /Users/tonyday/haskell/hecklist/foo/foo.cabal

    ✔ All clean! Stan did not find any observations at the moment.

             Stan's Summary:
  ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━┓
  ┃ Analysed modules             ┃ 2      ┃
  ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━┫
  ┃ Analysed Lines of Code       ┃ 23     ┃
  ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━┫
  ┃ Total Haskell2010 extensions ┃ 0      ┃
  ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━┫
  ┃ Total SafeHaskell extensions ┃ 0      ┃
  ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━┫
  ┃ Total checked inspections    ┃ 44     ┃
  ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━┫
  ┃ Total found observations     ┃ 0      ┃
  ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━┫
  ┃ Total ignored observations   ┃ 0      ┃
  ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━┫
  ┃ Project health               ┃ 100%   ┃
  ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━┛

  #+end_example

- [[https://hackage.haskell.org/package/haddock][haddock]]
  #+begin_src zsh :results output
  cabal haddock
  #+end_src

  #+RESULTS:
  #+begin_example
  Build profile: -w ghc-8.10.4 -O1
  In order, the following will be built (use -v for more details):
   - foo-0.0.1 (lib) (ephemeral targets)
  Preprocessing library for foo-0.0.1..
  Running Haddock on library for foo-0.0.1..
  Haddock coverage:
     0% (  0 /  1) in 'Lib'
    Missing documentation for:
      Module header
  Documentation created:
  /Users/tonyday/haskell/hecklist/foo/dist-newstyle/build/x86_64-osx/ghc-8.10.4/foo-0.0.1/doc/html/foo/index.html
  #+end_example

- [[https://hackage.haskell.org][Hackage]]

  Sometimes haddocks don't build on Hackage. Here's a recipe for uploading your own docs.

  #+begin_src zsh
  cabal haddock --builddir=docs --haddock-for-hackage --enable-doc
  cabal upload -d --publish docs/*-docs.tar.gz
  #+end_src

* GitHub

#+begin_src zsh results: output
cd foo
git init
git add .gitignore
git add **
git add .**
git commit -m "new project - forced automated commit"
git remote add origin https://github.com/tonyday567/foo.git
git push origin main --force
#+end_src

#+RESULTS:
: Reinitialized existing Git repository in /Users/tonyday/haskell/hecklist/foo/.git/
: On branch main
: nothing to commit, working tree clean
